#include "init.h"
/*****************************************************************************
 函 数 名  : WDT_Init
 功能描述  : WDT初始化,关闭WDT
 输入参数  : 无
 输出参数  : void
*****************************************************************************/
void WDT_Init()
{
    SFRPAGE = 0x00;
    WDTST = 0x00; // 0x00:关闭WDT ; 0x01:启动WDT
}
/*****************************************************************************
 函 数 名  : Crpm_Init
 功能描述  : 系统时钟73M
 输入参数  : 无
 输出参数  : void
*****************************************************************************/
void Crpm_Init()
{
    SFRPAGE = 0x02;
    SYS_CLK_SEL = 0x00;
    SYS_CLK_DIV = 0x00;
    CLK_EN0 = 0xff;
    CLK_EN1 = 0xff;
}
/*****************************************************************************
 函 数 名  : Interrupt_Init
 功能描述  : 中断配置
 输入参数  : 无
 输出参数  : void
*****************************************************************************/
void Interrupt_Init()
{
    ALL_INT_DISEN;
    IEN0 = 0x00;
    IEN1 = 0x00;
    IEN2 = 0x00;
    IP1 = 0xc0; //CMP中断优先级最搞
}
/*****************************************************************************
 函 数 名  : Port_Init
 功能描述  : GPIO口配置
 输入参数  : 无
 输出参数  : void
*****************************************************************************/
void Port_Init()
{
    AIOEN0 = BIT0 | BIT1 | BIT2 | BIT3 | BIT4; // PA0 PA1 PA2 PA3 PA4模拟
    AIOEN1 = BIT1 | BIT3;                      // PB2 PB4模拟
    PA0CTRL = BIT3;                            // 下拉
    PA1CTRL = BIT3;                            // 下拉
    PA2CTRL = BIT3;                            // 下拉
    PA3CTRL = BIT3;                            // 下拉
    PA4CTRL = BIT3;                            // 下拉
    PB2CTRL = BIT3;                            // 下拉
    PB4CTRL = BIT3;                            // 下拉
    PB3CTRL = BIT6;                            // TXD
    PB5CTRL = BIT6;                            // S2
    PB6CTRL = BIT6;                            // S1
    PC0CTRL = BIT1 | BIT6;                     // LED
}
/*************************************************************************************************
 函 数 名  : Delay_ms
 功能描述  : 延时1ms
 输入参数  : u16data
 输出参数  : 无
*************************************************************************************************/
void Delay_ms(u16 u16data)
{
    volatile u16 u16Temp = 0;
    volatile u16 u16Temp1 = 0;

    for (u16Temp = 0; u16Temp < u16data; u16Temp++)
    {
        for (u16Temp1 = 0; u16Temp1 < 1750; u16Temp1++)
            ;
    }
}

/*****************************************************************************
 函 数 名  : Delay_us
 功能描述  :延时1us[实际1.5us，3为2.5us]
 输入参数  : u16data
 输出参数  : 无
*****************************************************************************/
void Delay_us(u16 u16data)
{
    volatile u16 u16Temp = 0;

    for (u16Temp = 0; u16Temp < u16data; u16Temp++)
        ;
}